Mock_2/src/Documents/ЗаказКлиентаИМ/ЗаказКлиентаИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаИМ</name>
  <attributes>
    <name>guid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьСертификатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПокупателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаПокупателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДоставкиШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДоставкиДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозвратаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Mock_2/src/Documents/ЗаказКлиентаИМ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийф

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ЧасовойПояс.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьЗаказВТестируемуюБазу(Команда)
	
	ПараметрыОтправки = ПараметрыОтправкиДанныхВТестируемуюБазу();
	ПараметрыОтправки.ОтправлятьЗаказ = Истина;
	ЗаписатьДокументИОтправитьДанные(ПараметрыОтправки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОплатуВТестируемуюБазу(Команда)

	ПараметрыОтправки = ПараметрыОтправкиДанныхВТестируемуюБазу();
	ПараметрыОтправки.ОтправлятьОплату = Истина;
	ЗаписатьДокументИОтправитьДанные(ПараметрыОтправки);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаказИОплатуВТестируемуюБазу(Команда)
	
	ПараметрыОтправки = ПараметрыОтправкиДанныхВТестируемуюБазу();
	ПараметрыОтправки.ОтправлятьОплату = Истина;
	ПараметрыОтправки.ОтправлятьЗаказ = Истина;
	ЗаписатьДокументИОтправитьДанные(ПараметрыОтправки);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВозвратОплатыВТестируемуюБазу(Команда)
	
	ПараметрыОтправки = ПараметрыОтправкиДанныхВТестируемуюБазу();
	ПараметрыОтправки.ОтправлятьВозвратОплаты = Истина;
	ЗаписатьДокументИОтправитьДанные(ПараметрыОтправки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ПересчитатьСуммуВТекущейСтрокеТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоБазовыхЕдиницПриИзменении(Элемент)
	
	ПересчитатьСуммуВТекущейСтрокеТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ЗаписатьДокументИОтправитьДанные(ПараметрыОтправки)
	
	Если Модифицированность Тогда

		ТекстВопроса = НСтр("ru = 'Для продолжения операции необходимо записать документ.
							|Записать документ?'");

		Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Результат = Ждать Обещание;

		Если Результат = КодВозвратаДиалога.Да Тогда
			Если Записать() Тогда
				ОтправитьДанныеВТестируемуюБазуНаСервере(ПараметрыОтправки);
			КонецЕсли;
		КонецЕсли;

	Иначе
		ОтправитьДанныеВТестируемуюБазуНаСервере(ПараметрыОтправки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДанныеВТестируемуюБазуНаСервере(ПараметрыОтправки)

	ЭмуляцияИнтернетМагазина.ОтправитьЗаказВТестируемуюБазу(Объект.Ссылка, ПараметрыОтправки);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыОтправкиДанныхВТестируемуюБазу()
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("ОтправлятьЗаказ", Ложь);
	ПараметрыОтправки.Вставить("ОтправлятьОплату", Ложь);
	ПараметрыОтправки.Вставить("ОтправлятьВозвратОплаты", Ложь);
	
	Возврат ПараметрыОтправки;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуВТекущейСтрокеТоваров()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.КоличествоБазовыхЕдиниц;

КонецПроцедуры

#КонецОбласти
